NikolaosTsitselas/STM32_Examples/Pulse_oximeter_vol2/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32g0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MCO_Pin GPIO_PIN_0
#define MCO_GPIO_Port GPIOF
#define CIR_Pin GPIO_PIN_0
#define CIR_GPIO_Port GPIOA
#define CR_Pin GPIO_PIN_1
#define CR_GPIO_Port GPIOA
#define PIR_Pin GPIO_PIN_2
#define PIR_GPIO_Port GPIOA
#define PR_Pin GPIO_PIN_3
#define PR_GPIO_Port GPIOA
#define RED_signal_Pin GPIO_PIN_4
#define RED_signal_GPIO_Port GPIOA
#define IR_signal_Pin GPIO_PIN_5
#define IR_signal_GPIO_Port GPIOA
#define RED_AC_SIGNAL_Pin GPIO_PIN_6
#define RED_AC_SIGNAL_GPIO_Port GPIOA
#define IR_AC_SIGNAL_Pin GPIO_PIN_7
#define IR_AC_SIGNAL_GPIO_Port GPIOA
#define RED_Pin GPIO_PIN_11
#define RED_GPIO_Port GPIOB
#define IR_Pin GPIO_PIN_12
#define IR_GPIO_Port GPIOB
#define TMS_Pin GPIO_PIN_13
#define TMS_GPIO_Port GPIOA
#define TCK_Pin GPIO_PIN_14
#define TCK_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
